#include <stdio.h>

int main() {
    int x, z;
    float y;

    printf("Введіть ціле число x: ");
    scanf("%d", &x);

    printf("Введіть ціле число z: ");
    scanf("%d", &z);
    
    // Логіка обчислення залежно від значення x
    if (x == 5) {
        y = 3 + x * z;
        printf("Результат y = %.2f\n", y);
    } 
    if (x == -5 && 7 - z != 0) {
            y = x + z / (7 - z);
            printf("Результат y = %.2f\n", y);
        }
     
    if (x == 0) {
        y = x;
        printf("Результат y = %.2f\n", y);
    } 
    if (x != 5 && x != -5 && x != 0) {
        printf("Помилка!Обчислити неможливо, x не дорівнює 5, -5 або 0.\n");
    }
    if (x == -5 && 7 - z ==0){
        printf("Помилка!Ділення на 0");
    }

    return 0;
}